app/controllers/api/items_controller.rb

INSERT INTO "items" ("name", "list_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Buy a costume"], ["list_id", 6], ["created_at", "2017-09-27 03:47:38.738765"], ["updated_at", "2017-09-27 03:47:38.738765"]]
---
  def create
    item = Item.new(item_params)
    item.list_id = @list.id

    if item.save

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "items" SET "completed" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["completed", "t"], ["updated_at", "2017-09-26 02:16:08.243464"], ["id", 5]]
---
  def update
    item = Item.find(params[:id])
    if item.update(item_params)

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def set_list
    @list = List.find(params[:list_id])