app/controllers/api/lists_controller.rb

  def create
    list = List.new(list_params)
    list.user_id = @user.id

    if list.save
---
INSERT INTO "lists" ("name", "private", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Things to do today"], ["private", "t"], ["created_at", "2017-09-19 03:24:14.653324"], ["updated_at", "2017-09-19 03:24:14.653324"]]

  def update
    list = List.find(params[:id])
    if list.update(list_params)
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "lists" SET "private" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["private", "t"], ["updated_at", "2017-09-26 02:11:03.178473"], ["id", 5]]

  def destroy
    begin
      list = List.find(params[:id])
      list.destroy
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 4]]