app/controllers/api/users_controller.rb

INSERT INTO "users" ("username", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "Sterling"], ["password", "Archer"], ["created_at", "2017-09-19 02:53:08.776231"], ["updated_at", "2017-09-19 02:53:08.776231"]]
---
  def create
    user = User.new(user_params)

    if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 6]]
---
  def destroy
    begin
      user = User.find(params[:id])
      user.destroy